<?php
/**
 * ShopEx licence
 *
 * @copyright  Copyright (c) 2005-2012 ShopEx Technologies Inc. (http://www.shopex.cn)
 * @license  http://ecos.shopex.cn/ ShopEx License
 */

return array(

    'enabled' => false,
    /*
    |--------------------------------------------------------------------------
    | 默认缓存处理
    |--------------------------------------------------------------------------
    |
    | 默认缓存处理类
    | 目前支持 base_cache_secache | base_cache_nocache | base_cache_memcached
    | 对应原系统: WITHOUT_CACHE CACHE_STORAGE
    |
    */
    'default' => 'base_cache_secache',

    
    /*
    |--------------------------------------------------------------------------
    | cache存储key前缀 
    |--------------------------------------------------------------------------
    |
    | cache存储key前缀
    |
    */
    'prefix' => 'bbc-cache-',
    
    /*
    |--------------------------------------------------------------------------
    | secache配置
    |--------------------------------------------------------------------------
    |
    | size 设置预分配文件大小
    |
    */
    'base_cache_secache' => array(
        'size' => '1g', //缓存大小,最大不能超过1G
    ),

    /*
    |--------------------------------------------------------------------------
    | memcached配置
    |--------------------------------------------------------------------------
    |
    | 支持 socket  'unix:///tmp/memcached.sock' 和 '127.0.0.1:11211'两种写法
    |
    */
    'base_cache_memcached' => array(
        'hosts' => array(
            '127.0.0.1:11211',
            '127.0.0.1:11212',
        )
    ),
);
