<?php
/**
 * ShopEx licence
 *
 * @copyright  Copyright (c) 2005-2012 ShopEx Technologies Inc. (http://www.shopex.cn)
 * @license  http://ecos.shopex.cn/ ShopEx License
 *
 * 取消订单是会员和商家各自的原因展示
 */

return array(
    'user' => array(
        '1' => "现在不想购买",
        '2' => "商品价格较贵",
        '3' => "价格波动",
        '4' => "商品缺货",
        '5' => "重复下单",
        '6' => "订单商品选择有误",
        '7' => "支付方式选择有误",
        '8' => "收货信息填写有误",
        '9' => "发票信息填写有误",
        '10' => "无法支付订单",
        'other' => "其他原因",
    ),
    'shopuser' => array(
        '1' => "客户现在不想购买",
        '2' => "客户商品价格较贵",
        '3' => "客户价格波动",
        '4' => "客户商品缺货",
        '5' => "客户重复下单",
        '6' => "客户订单商品选择有误",
        '7' => "客户支付方式选择有误",
        '8' => "客户收货信息填写有误",
        '9' => "客户发票信息填写有误",
        '10' => "客户无法支付订单",
        '11' => "客户长时间未付款",
        'other' => "客户其他原因",
    ),
);
